app/views/plants/show.html.erb

  <ul>
    <% @plant.tasks.each do |task| %>
---
SELECT "tasks".* FROM "tasks" WHERE "tasks"."plant_id" = $1  [["plant_id", 1]]