app/controllers/plants_controller.rb

  def create
    @plant = Plant.create(whitelisted_params)
---
INSERT INTO "plants" ("user_id", "name", "medium", "type_of_fertilizer", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["user_id", 1], ["name", "d"], ["medium", "d"], ["type_of_fertilizer", "01:00"], ["created_at", "2017-08-03 21:08:23.018128"], ["updated_at", "2017-08-03 21:08:23.018128"]]

  def find_plant
    @plant = Plant.find_by(id: params[:id])
---
SELECT  "plants".* FROM "plants" WHERE "plants"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]