app/controllers/tasks_controller.rb

  def create
    @task = @plant.tasks.build(whitelisted_params)

    if @task.save
---
INSERT INTO "tasks" ("plant_id", "name", "description", "time", "price", "updated_at", "created_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

  def find_plant
    @plant = Plant.find(params[:plant_id])
---
SELECT  "plants".* FROM "plants" WHERE "plants"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def find_task
    @task = @plant.tasks.find(params[:id])
---
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."plant_id" = $1 AND "tasks"."id" = $2 LIMIT $3  [["plant_id", 1], ["id", 1], ["LIMIT", 1]]